public class Main {
    public static void main(String[] args) {
        //'A' = 65 = 1000001
        //'B' = 66 = 1000010

        //[1   2   3   4   5   6   7   8   9   0    ]
        /*
        0
        10  = 1 десяток 0 единиц
        49  = 4 десятка 9 единиц
        50  = 5 десятков 0 единиц
        51  = 5 десятков 1 единиц
        ...
        59

        99
       100 = 1 сотня 0 десятков 0 едениц


        */

        // Двоичная система
        //[1   0 ]
        /*
        Двоичная      Десятичная
          0                0
          1                1
         10                2
         11                3
        100                4
        101                5
        110                6
        111                7
       1000                8
       ....
       1111
      1
      10000
         */

        // Восмиричная система
        //[0    1   2   3   4   5   6   7 ]
        /*
        0
        1
        2
        3
        4
        5
        6
        7                  7
       10                  8
       11                  9
       12                  10
       13                  11
       14                  12
       15                  13
       16                  14
       17                  15
       20                  16
         */

        // Шестнадцатиричная
        //[0   1   2   3   4   5   6   7   8   9  A  B  C  D  E  F      ]
        //  16         10
        /*
            0         0
            1         1
            2         2
            3         3
            4         4
            5         5
            6         6
            7         7
            8         8
            9         9
            A        10
            B        11
            C        12
            D        13
            E        14
            F        15
           10         16
           11         17



        */

        /*  Основание 10

          10^3    10^2    10^1       10^0
            5       4       9          1
        5000       400     90          1


        754 =  (4*10^0 + 5 * 10^1 + 7*10^2)


         */

        /*  2^2       2^1       2^0
             1         0         1
             4     +   0  +     1  =5

        1000001 = (1*2^0 + 0*2^1 + 0*2^2 + 0*2^3 + 0*2^4 + 0*2^5 + 1*2^6) = 64+1 =65

      1024       512       256      128       64 (2^6) 32       16     8     4     2    1
                            1        0         1       1        1      0     0     1    1     =  256+64+32+16+2+1 =371
                                               1       0        1      0     0     0    1    = 81

         */
        /*
        String str = "1010001";
        str.charAt(str.length()-1);   2^0
        str.charAt(str.length()-2);   2^1
        str.charAt(str.length()-3);   2^2
                ......
        2^str.len
        2^str.len-1
        2^str.len-2
        ....
        Math.pow(2,  )



         */
        String str = "1010001";
        for (int i = 0; i < str.length(); i++) {
            int pow = (int) Math.pow(2,str.length()-i);
        }
    }
}