/*
Создайте метод, который принимает массив слов, и заменяет все самые длинные слова на "***".

Например,для массива {"John","Ann", "Jack", "Ray"} вызов метода изменит
массив на  {"***","Ann", "***", "Ray"}.
Данный метод должен менять исходный массив.

1) узнать длинну самого длинного слова (длинных слов)
2) Бежать по массиву и менять длинные слова

 */


public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}