Задача 1. 

Для того чтобы успевать за нами писать код, вы должны найти на своей клавиатуре следующие символы

```console
#  <  >  +  - ,  .  :  ; (  ) {  }  /  \
```
Задача 2. 

Напишите программу, которая выводит на экран информацию о вас (или выдуманном персонаже) в три строчки:
```console
"Меня зовут ..."
"Мне ... лет"
"Я из ..."
```

Задача 3.
 
Исправте все ошибки в программе:
```java
public class nested.example01.Main {
   public static void main(String[] args) {
     System.Оut.Рrintln("Hello! ")
     system.out.println("I'am Java programmer ")
     System.out.print("This program does not work, ")
     System.out.println("but I can make it good ")
   }
   System.out.println("---- done ------");
}
```

